Repository: rimas-kudelis/NeatoControl
Catalog: languages/NeatoControl.*.po
Languages: de, he

source: Neato Control
de: Neato Kontrolle
he: בקרת Neato

source: Auto connect on plug
de: Erkennung bei der Anmeldung
he: אוטומטי להתחבר על תקע

source: Auto detect port number
de: die Portnummer Erkennung
he: זיהוי אוטומטי מספר יציאה

source: require rotate the robot to the up
de: erforderlich drehen Sie den Roboter an die up
he: דורש לסובב את הרובוט לעד

source: Save log to file
de: Speichern
he: שמור יומן להגיש

source: Auto update
he: עדכון אוטומטי

source: Separate all cmd "==="
de: Unterteilen Sie Befehlszeile "==="
he: הנפרד כל cmd "==="

source: Translate author: heX
de: Der Autor der Übersetzung: Uranus-13, heX
he: תרגום מחבר: Hex

source: Version:
he: גרסה:

source: Timers:
he: טיימרים:

source: Commands list:
de: Befehlsliste:
he: רשימת פקודות:

source: Step 1:
de: Schritt 1:
he: שלב 1:

source: Step 2:
de: Schritt 2:
he: שלב 2:

source: Step 3:
de: Schritt 3:
he: שלב 3:

source: Step 4:
de: Schritt 4:
he: שלב 4:

source: Step 5:
de: Schritt 5:
he: שלב 5:

source: COM Port name:
de: COM-Port-Nummer:
he: שם יציאת ה- COM:

source: Language:
de: Sprache:
he: שפה:

source: Robot Time:
de: Time:
he: זמן רובוט:

source: Batt V < 12 V
he: אט V <12 V

source: Scanner
he: סורק

source: Sensors
de: Sensoren
he: חיישנים

source: Options
de: Optionen
he: אפשרויות

source: Recharge
de: Laden
he: טעינה

source: About
he: אודות

source: Commands
de: Befehle
he: פקודות

# TMODULEMAIN.MNCOPY.CAPTION
source: Copy
he: העתק

# TFRMMAIN.BTNCOPYALL_LOG.CAPTION
source: copy all
de: kopieren Sie alle
he: להעתיק את כל

source: Brush
de: Bürste
he: מברשת

source: Left Wheel
de: Linke Rad
he: שמאל גלגל

source: Right Wheel
de: Richtige Rad
he: גלגל ימני

source: Side Brush
de: Seitenbürste
he: צד מברשת

source: Vacuum
de: Vakuum
he: אבק

source: Translate: https://poeditor.com/join/project/EdLcbGzBsR
de: Übersetzen: https://poeditor.com/join/project/EdLcbGzBsR
he: תרגום: https://poeditor.com/join/project/EdLcbGzBsR

source: Motors
de: Motoren
he: מנועים

source: WARNING: Rotate the robot so the wheels are facing up before enable wheels motor!
de: ACHTUNG: Drehen Sie den Roboter so die Räder nach oben, bevor aktivieren Räder Motor!
he: אזהרה: סובב את הרובוט כך הגלגלים פונים כלפי מעלה לפני לאפשר מנוע גלגלים!

# ustrres.disable
source: Disable
he: שבת

# ustrres.enable
source: Enable
he: לְאַפשֵׁר

source: Show state
he: מדינת צג

source: Blue - intensity, Green - length, Red - error, Black - not visible
he: עוצמת, גרין - - כחול אורך, אדום - שגיאה, שחור - לא גלוי

source: Schedule
he: לוח זמנים

# TMODULEMAIN.ACTCHRENABLEBRUSH.CAPTION
source: Enable Brush Motor and Disconnect
he: אפשר מברשת מנועיים נתק

# TMODULEMAIN.ACTCHRENABLEVACCUM.CAPTION
source: Enable Vaccum Motor and Disconnect
he: אפשר אבק מנועיים נתק

# TMODULEMAIN.ACTCHRSET100PERCENTBATTERY.CAPTION
source: Set 100% Battery
he: גדר 100% סוללה

# TMODULEMAIN.ACTCONNECT.CAPTION
source: Connect
he: לְחַבֵּר

# TMODULEMAIN.ACTCOPYSENSORDATA.CAPTION
source: copy all
he: להעתיק את כל

# TMODULEMAIN.ACTDISCONNECT.CAPTION
source: Disconnect
he: לְנַתֵק

# TMODULEMAIN.ACTGETLIFESTATLOG.CAPTION
source: Get Log
he: קבל יומן

# TMODULEMAIN.ACTREMOTECONTROL.CAPTION
source: Remote Control (push arrows)
he: שלט רחוק (דחיפת חיצים)

# TMODULEMAIN.ACTSCANLDS.CAPTION
source: Scan LDS
he: LDS סריקה

# TMODULEMAIN.ACTSETCURRENTTIME.CAPTION
source: Set time to Neato from computer
he: גדר זמן Neato ממחשב

# TMODULEMAIN.ACTSETSCHEDULE.CAPTION
source: Save Schedule
he: שמור את התזמון

# TMODULEMAIN.ACTTESTMODEOFF.CAPTION
source: Disable
he: שבת

# TMODULEMAIN.ACTTESTMODEON.CAPTION
source: Enable
he: לְאַפשֵׁר

source: Schedule enabled
he: לוח זמנים מופעל

# tmodulemain.actbtnsendcmd.caption
source: Run
he: הפעלה

# TMODULEMAIN.ACTTESTMODEENABLED.CAPTION
source: Test mode enabled
he: בדיקת מצב מופעלת

# ustrres.errorcantopenportcom
source: Can't open port COM
he: לא יכול לפתוח את יציאת COM

# ustrres.errorcomportnotdetect
source: COM port not detect
he: יציאת ה- COM לא תזהה

# ustrres.errorinvalidcomportnumber
source: invalid COM port number
he: מספר יציאת ה- COM לא חוקי

# ustrres.friday
source: Friday
he: יום שישי

# ustrres.monday
source: Monday
he: יום שני

source: in seconds
he: במקום השני

# ustrres.saturday
source: Saturday
he: יום שבת

# ustrres.sunday
source: Sunday
he: יום ראשון

# ustrres.textdisabled
source: Disabled
he: נכים

# ustrres.textenabled
source: Enabled
he: מופעל

# ustrres.thursda
source: Thursday
he: יום חמישי

# ustrres.tuesday
source: Tuesday
he: יום שלישי

# ustrres.wednesday
source: Wednesday
he: יום רביעי

source: Enable Brush Motor and Disconnect
de: Auf der Motor des Staubsaugers und unplug

source: Enable Vaccum Motor and Disconnect
de: Auf den Motorbürsten und unplugged

source: Set 100% Battery
de: Emulate 100% charge

source: copy all
de: Alle kopieren

source: Load Schedule
de: Laden

source: Remote Control (push arrows)
de: Fernsteuerung (drcken Sie sterben Pfeile)

source: Scan LDS
de: LIDAR-Scanner

source: Set time to Neato from computer
de: setzen Sie den Zeitplan für sterben NEATO aus dem Computer

source: Save Schedule
de: Speichern

# TFRMMAIN.ACTTESTMODEOFF.CAPTION
source: Disable
de: OFF.

# TFRMMAIN.ACTTESTMODEON.CAPTION
source: Enable
de: Ein.

source: Enable constantly
de: On. ever

# tfrmmain.btnschdis.caption
source: Disable
de: Deaktiviert

# tfrmmain.btnschen.caption
source: Enable
de: Aktiviert

source: Auto (recommended)
de: Auto (empfohlen)

# TFRMMAIN.CBREPEATTIME4.HINT
source: in second
de: In Sekunden

# tfrmmain.cbrepeattime4.text
source: OFF
de: Aus.

# TFRMMAIN.CBREPEATTIME5.HINT
source: in second
de: In Sekunden

# TFRMMAIN.CBREPEATTIME6.HINT
source: in second
de: In Sekunden

# TFRMMAIN.CBREPEATTIME7.HINT
source: in second
de: In Sekunden

# TFRMMAIN.CBREPEATTIME8.HINT
source: in second
de: In Sekunden

# TFRMMAIN.CBREPEATTIME9.HINT
source: in second
de: In Sekunden

source: Use test mode
de: Verwenden Sie Testmodus

# tfrmmain.groupbox3.caption
source: Connect
de: Verbinden

source: Schedule && Time
de: Planung und Zeit

# tfrmmain.groupboxtimers.hint
source: in second
de: In Sekunden

source: Schedule:
de: Zeitplan:

source: Test mode:
de: Testmodus:

source: Can't open port COM
de: Kann Port COM nicht öffnen

source: Error clearing port. (ClearCommError)
de: Fehler Clearing-Port. (ClearCommError)

source: COM port not detect
de: COM-Port nicht erkennen

source: invalid COM port number
de: ungültige COM-Port-Nummer

source: Saturday
de: Sabbath

source: Disabled
de: Aus

source: Enabled
de: Ein

# tfrmmain.actcopysensordata.caption
source: copy all
de: kopieren Sie alle

source: Get Log
de: Holen Sie sich Anmelden
